-- ==========================================================
-- файл: 01_drop_tables.sql
--
-- назначение:
-- удаление всех таблиц проекта.
--
-- используется при полном пересоздании базы данных.
-- ==========================================================


-- ==========================================================
-- удаление raw-таблиц
-- ==========================================================

drop table if exists attempts_raw;
drop table if exists tasks_raw;
drop table if exists dictionary_raw;

-- ==========================================================
-- удаление основных таблиц
-- ==========================================================

drop table if exists attempts cascade;
drop table if exists tasks cascade;
drop table if exists dictionary cascade;


-- ==========================================================
-- ожидаемый результат
--
-- ✓ все основные таблицы удалены
-- ✓ все raw-таблицы удалены
--
-- следующий шаг:
-- 02_create_tables.sql
-- ==========================================================