-- ==========================================================
-- файл: 07_create_task_bank_raw.sql
--
-- назначение:
-- создание raw-таблицы
-- для банка задач.
-- ==========================================================


-- ==========================================================
-- task_bank_raw
-- ==========================================================

create table task_bank_raw (
    bank_task_code text,
    domain text,
    pattern text,
    "group" text,
    subgroup text,
    difficulty smallint,
    source text,
    title text,
    task_description text,
    solution_outline text,
    common_mistakes text
);


-- ==========================================================
-- ожидаемый результат
--
-- ✓ создана таблица task_bank_raw
--
-- следующий шаг:
-- импортировать данные из Excel
-- ==========================================================

